//#include "theme_p.hpp"

//Theme::Theme(QObject *parent)
//    : QObject{parent}
//    , d_ptr(new ThemePrivate(this))
//{

//}

//QList<QString> Theme::color() const { return m_color; }
//void Theme::setColor(const QList<QString>& list) {
//    if (m_color == list) return;
//    m_color = list;
//    emit colorChanged();
//}

///****************************************************************************************************************************************************************
//███████████████████████████          🔒 PRIVATE IMPLEMENTATION 🔒          ███████████████████████████████──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────f
//*****************************************************************************************************************************************************************/

//ThemePrivate::ThemePrivate(QObject *parent)
//    : q_ptr((Theme*)parent)
//{

//}



//QPointF Theme::scalingFactor() const
//{
//    return m_scalingFactor;
//}

//void Theme::setScalingFactor(QPointF newScalingFactor)
//{
//    if (m_scalingFactor == newScalingFactor)
//        return;
//    m_scalingFactor = newScalingFactor;
//    emit scalingFactorChanged();
//}
